Autodesk.Revit.DB.PointNode.GetPoint
Returns the point object corresponding to the node.
Returns:
The point instance.
Since:
2016

Autodesk.Revit.DB.PointNode
An output node that represents a 3D point.
Remarks:
See also: Autodesk::Revit::DB::IModelExportContext::OnPoint.
Since:
2016